<a href="https://colab.research.google.com/github/OlegV12/GoogleColab/blob/Lesson1/Lesson1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Импортируйте библиотеку Numpy и дайте ей псевдоним np.
Создайте массив Numpy под названием a размером 5x2, то есть состоящий из 5 строк и 2 столбцов. Первый столбец должен содержать числа 1, 2, 3, 3, 1, а второй - числа 6, 8, 11, 10, 7. Будем считать, что каждый столбец - это признак, а строкастрlока - наблюдение. Затем найдите среднее значение по каждому признаку, используя метод mean массива Numpy. Результат запишите в массив mean_a, в нем должно быть 2 элемента.

In [224]:
import numpy as np

In [225]:
a = np.array([[1, 6,], 
              [2, 8,], 
              [3, 11,], 
              [3, 10,], 
              [1, 7,]])

In [226]:
mean_a = a[:, :1].mean(), a[:, 1:].mean()

In [227]:
mean_a

(2.0, 8.4)

Вычислите массив a_centered, отняв от значений массива “а” средние значения соответствующих признаков, содержащиеся в массиве mean_a. Вычисление должно производиться в одно действие. Получившийся массив должен иметь размер 5x2.

In [228]:
a_centered = a - mean_a

In [229]:
a_centered

array([[-1. , -2.4],
       [ 0. , -0.4],
       [ 1. ,  2.6],
       [ 1. ,  1.6],
       [-1. , -1.4]])

Найдите скалярное произведение столбцов массива a_centered. В результате должна получиться величина a_centered_sp. Затем поделите a_centered_sp на N-1, где N - число наблюдений.

In [230]:
a_centered_sp = np.dot(np.reshape(a_centered[:, :1], 5), np.reshape(a_centered[:, 1:], 5))

In [231]:
a_centered_sp

8.0

In [232]:
a_centered_sp / (len(a_centered) - 1)

2.0

In [233]:
np.cov(a.T)[0, 1]

2.0

Импортируйте библиотеку Pandas и дайте ей псевдоним pd. Создайте датафрейм authors со столбцами author_id и author_name, в которых соответственно содержатся данные: [1, 2, 3] и ['Тургенев', 'Чехов', 'Островский'].
Затем создайте датафрейм book cо столбцами author_id, book_title и price, в которых соответственно содержатся данные:  
[1, 1, 1, 2, 2, 3, 3],
['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
[450, 300, 350, 500, 450, 370, 290].

In [234]:
import pandas as pd

In [235]:
a = {'author_id': [1, 2, 3,], 'author_name': ['Тургенев', 'Чехов', 'Островский']}
authors = pd.DataFrame(a).set_index('author_id')

In [236]:
authors

          author_name
author_id
1            Тургенев
2               Чехов
3          Островский

In [237]:
b = {'author_id': [1, 1, 1, 2, 2, 3, 3], 
     'book_title': ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'], 
     'price': [450, 300, 350, 500, 450, 370, 290]}
book = pd.DataFrame(b)

In [238]:
book

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

Получите датафрейм authors_price, соединив датафреймы authors и books по полю author_id.

In [239]:
authors_price = pd.merge(authors, book, on='author_id', how='inner')

In [240]:
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

Создайте датафрейм top5, в котором содержатся строки из authors_price с пятью самыми дорогими книгами.

In [241]:
top5 = authors_price.sort_values(by='price', ascending=False).head(5)

In [242]:
top5

   author_id author_name         book_title  price
3          2       Чехов   Толстый и тонкий    500
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островский              Гроза    370
2          1    Тургенев  Дворянское гнездо    350

Создайте датафрейм authors_stat на основе информации из authors_price. В датафрейме authors_stat должны быть четыре столбца:
author_name, min_price, max_price и mean_price,
в которых должны содержаться соответственно имя автора,минимальная, максимальная и средняя цена на книги этого автора .

In [243]:
authors_stat = pd.DataFrame(authors_price.groupby('author_name').agg({'price': ['min', 'max', 'mean']}))
authors_stat.columns = ['min_price', 'max_price', 'mean_price']
authors_stat

             min_price  max_price  mean_price
author_name
Островский         290        370  330.000000
Тургенев           300        450  366.666667
Чехов              450        500  475.000000

Создайте новый столбец в датафрейме authors_price под названием cover, в нем будут располагаться данные о том, какая обложка у данной книги - твердая или мягкая. В этот столбец поместите данные из следующего списка:
['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая'].
Просмотрите документацию по функции pd. с помощью вопросительного знака.Для каждого автора посчитайте суммарную стоимость книг в твердой и мягкой обложке. Используйте для этого функцию pd.pivot_table. При этом столбцы должны называться "твердая" и "мягкая", а индексами должны быть фамилии авторов. Пропущенные значения стоимостей заполните нулями, при необходимости загрузите библиотеку Numpy.
Назовите полученный датасет book_info и сохраните его в формат pickle под названием "book_info.pkl". Затем загрузите из этого файла датафрейм и назовите его book_info2. Удостоверьтесь, что датафреймы book_info и book_info2 идентичны.

In [244]:
cover = ['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']
authors_price['cover'] = cover
authors_price

   author_id author_name            book_title  price    cover
0          1    Тургенев           Отцы и дети    450  твердая
1          1    Тургенев                 Рудин    300   мягкая
2          1    Тургенев     Дворянское гнездо    350   мягкая
3          2       Чехов      Толстый и тонкий    500  твердая
4          2       Чехов       Дама с собачкой    450  твердая
5          3  Островский                 Гроза    370   мягкая
6          3  Островский  Таланты и поклонники    290   мягкая

In [245]:
?pd

In [246]:
?pd.pivot_table

In [247]:
book_info = pd.pivot_table(authors_price, values='price', index=['author_name', 'cover'], aggfunc=np.sum, fill_value=0)
book_info

                     price
author_name cover
Островский  мягкая     660
Тургенев    мягкая     650
            твердая    450
Чехов       твердая    950

In [248]:
book_info.to_pickle("book_info.pkl")
book_info2 = pd.read_pickle("book_info.pkl")

In [249]:
book_info.equals(book_info2)

True

Скачать данные из соревнования, пока можете работать только с train.csv. Считать их.

Посчитать основные статистики по каждому признаку (минимальные, максимальные, средние значения). Сделать выводы об адекватности этих статистик.

Посчитать для каждого признака, сколько в нем уникальных значений и как часто они встречаются. Сделать выводы по каждому признаку.

Используя выводы из двух предыдущих заданий, найдите те наблюдения, где есть пропуски, выбросы или неадекватные значения, используя фильтрацию из pandas.

In [ ]:
from google.colab import files
uploaded = files.upload()

In [251]:
train = pd.read_csv('train.csv').fillna(0)
train

         Id  DistrictId  Rooms  ...  Shops_1  Shops_2          Price
0     11809          27    3.0  ...        0        B  305018.871089
1      3013          22    1.0  ...        0        B  177734.553407
2      8215           1    3.0  ...        1        B  282078.720850
3      2352           1    1.0  ...        1        B  168106.007630
4     13866          94    2.0  ...        6        B  343995.102962
...     ...         ...    ...  ...      ...      ...            ...
9995   1260          61    2.0  ...        9        B  119367.455796
9996  16265          27    2.0  ...        0        A  199715.148807
9997   2795         178    1.0  ...        5        B  165953.912580
9998  14561          21    1.0  ...        5        B  171842.411855
9999   7202          94    1.0  ...        9        B  177685.627486

[10000 rows x 20 columns]

In [252]:
train_stat = pd.DataFrame(train.agg({'DistrictId': ['min', 'max', 'mean'],
                                     'Rooms': ['min', 'max', 'mean'], 
                                     'Square': ['min', 'max', 'mean'],
                                     'LifeSquare': ['min', 'max', 'mean'],
                                     'KitchenSquare': ['min', 'max', 'mean'],
                                     'Floor': ['min', 'max', 'mean'],
                                     'HouseFloor': ['min', 'max', 'mean'],
                                     'HouseYear': ['min', 'max', 'mean'],
                                     'Ecology_1': ['min', 'max', 'mean'],
                                     'Ecology_2': ['min', 'max', 'mean'],
                                     'Ecology_3': ['min', 'max', 'mean'],
                                     'Social_1': ['min', 'max', 'mean'],
                                     'Social_3': ['min', 'max', 'mean'],
                                     'Healthcare_1': ['min', 'max', 'mean'],
                                     'Helthcare_2': ['min', 'max', 'mean'],
                                     'Shops_1': ['min', 'max', 'mean'],
                                     'Shops_2': ['min', 'max', 'mean'],
                                     'Price': ['min', 'max', 'mean']
                                     }))
train_stat

      DistrictId    Rooms      Square  ...  Shops_1  Shops_2          Price
max     209.0000  19.0000  641.065193  ...  23.0000        B  633233.466570
mean     50.4008   1.8905   56.315775  ...   4.2313      NaN  214138.857399
min       0.0000   0.0000    1.136859  ...   0.0000        A   59174.778028

[3 rows x 18 columns]

In [ ]:
train_stat_district = train.groupby(['DistrictId'
                   ])['Id'].nunique()
train_stat_district

In [ ]:
train_stat_rooms = train.groupby(['Rooms'
                   ])['Id'].nunique()
train_stat_rooms

In [ ]:
train_stat_square = train.groupby('Square')['Id'].nunique()
train_stat_square

In [ ]:
train_stat_life_square = train.groupby('LifeSquare')['Id'].nunique()
train_stat_life_square

In [ ]:
train_stat_kitchen_square = train.groupby('KitchenSquare')['Id'].nunique()
train_stat_kitchen_square

In [ ]:
train_stat_floor = train.groupby('Floor')['Id'].nunique()
train_stat_floor

In [ ]:
train_stat_house_floor = train.groupby('HouseFloor')['Id'].nunique()
train_stat_house_floor

In [ ]:
train_stat_house_year = train.groupby('HouseYear')['Id'].nunique()
train_stat_house_year

In [ ]:
train_stat_eco_1 = train.groupby('Ecology_1')['Id'].nunique()
train_stat_eco_1

In [ ]:
train_stat_eco_2 = train.groupby('Ecology_2')['Id'].nunique()
train_stat_eco_2

In [ ]:
train_stat_eco_3 = train.groupby('Ecology_3')['Id'].nunique()
train_stat_eco_3

In [ ]:
train_stat_soc_1 = train.groupby('Social_1')['Id'].nunique()
train_stat_soc_1

In [ ]:
train_stat_soc_3 = train.groupby('Social_3')['Id'].nunique()
train_stat_soc_3

In [ ]:
train_stat_health_1 = train.groupby('Healthcare_1')['Id'].nunique()
train_stat_health_1

In [ ]:
train_stat_health_2 = train.groupby('Helthcare_2')['Id'].nunique()
train_stat_health_2

In [ ]:
train_stat_shops_1 = train.groupby('Shops_1')['Id'].nunique()
train_stat_shops_1

In [ ]:
train_stat_shops_2 = train.groupby('Shops_2')['Id'].nunique()
train_stat_shops_2

In [ ]:
train_stat_price = train.groupby('Price')['Id'].nunique()
train_stat_price

In [253]:
train.query('(Rooms == 0) | (Square < 10) | (LifeSquare > 640) | (LifeSquare == 0) | (KitchenSquare <= 3) | (KitchenSquare > 130) | (HouseFloor <= 0)| (HouseFloor > 50) | HouseYear > 2021')

         Id  DistrictId  Rooms  ...  Shops_1  Shops_2          Price
0     11809          27    3.0  ...        0        B  305018.871089
3      2352           1    1.0  ...        1        B  168106.007630
8      9951           1    1.0  ...        1        B  160400.401732
9      8094           6    3.0  ...        0        B  194756.023945
18     4581           1    1.0  ...        1        B  128803.593810
...     ...         ...    ...  ...      ...      ...            ...
9983    647           1    2.0  ...        1        B  183809.327114
9990  10635          21    1.0  ...        5        B  112411.221700
9991  11173           6    2.0  ...        0        B  182625.548872
9993   9289           1    3.0  ...        1        B  264213.558631
9996  16265          27    2.0  ...        0        A  199715.148807

[3330 rows x 20 columns]